Revit 2024 API
Frame.BasisZ Property
 The third basis vector of the frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public XYZ BasisZ { get; set; }
Visual Basic
Public Property BasisZ As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ BasisZ {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Frame Class
Autodesk.Revit.DB Namespace